Revit 2026 API

# DimensionTypeGetSpecTypeId Method

---

Gets the spec of this dimension style.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ForgeTypeId GetSpecTypeId()
```
```vb
Public Function GetSpecTypeId As ForgeTypeId
```
```cpp
public:
ForgeTypeId^ GetSpecTypeId()
```
```fsharp
member GetSpecTypeId : unit -> ForgeTypeId
```

#### Return Value

ForgeTypeId Identifier of the spec.

The spec will represent either length, angle or slope.

#### Reference

DimensionType Class

Autodesk.Revit.DB Namespace